const express = require("express");
const app = express();
const path = require("path");

const services = [
    {title: 'Wedding', url: 'img/wedding.png'}, 
    {title: 'House Warming', url: 'img/house-warming.png'}, 
    {title: 'Namakaranam', url: 'img/namakaranam.png'}, 
    {title: 'Marriage Matching', url: 'img/matching.png'}, 
    {title: 'Numerology', url: 'img/numerology.png'}, 
    {title: 'Vaasthu', url: 'img/vaasthu.png'}];
    
const servicesLg = [
    {title: 'Kumbhabhishekham', url: 'img/kumbhabhishekham.png', desc: 'ஸ்ரீ பாஞ்சராத்ர ஆகம முறைப்படி பெருமாள் கோயில் மகா கும்பாபிஷேகம் சிறப்பாக நடத்திக் கொடுக்கப்படும் மேலும் எல்லா தெய்வங்களுக்கும் நூதன விக்கிரகம் பிரதிஷ்டை செய்து கும்பாபிஷேகம் மிகச் சிறப்பான முறையில் செய்து கொடுக்கப்படும். பன்னிரண்டு வருடம் முடிந்த கோயில்களுக்கு மீண்டும் கும்பாபிஷேகம் சிறப்பான முறையில் நடத்தி கொடுக்கப்படும். கோயில்கள் விதிமுறைப்படி புதிய ஆலயம் அமைத்துக் கொடுக்கப்படும்'},
];
    
const products = [
    {title: 'Sourashtra Gothrakhandam - Marriage matching', url: 'https://play.google.com/store/apps/details?id=com.Sre.gothrakhando', imgUrl: 'img/gothrakhandam-icn.png'},
    {title: 'Numerology predict', url: 'https://play.google.com/store/apps/details?id=com.triplestar.numerology', imgUrl: 'img/numerology-icn.png'}];

const homams = [
    {
        eTitle: 'Sri Lakshmi Narayana Homam',
        tTitle: 'ஸ்ரீலட்சுமி நாராயண ஹோமம்',
        desc: 'ஸ்ரீ லக்ஷ்மி நாராயண ஹோமம் எல்லா பலன்களையும் கொடுக்கும்.\nபடிப்பு அறிவு செல்வம் ஞானம் பக்தி மற்றும் நாம் என்ன வேண்டுகிரோமோ அனைத்தையும் கொடுக்க வல்லது இந்த லட்சுமி நாராயண ஹோமம். குறிப்பாக ஸ்ரீமகாலட்சுமியின் ஸ்ரீசூக்த ஹோமம் ஆனது நிறைய பொருட் செல்வத்தை அள்ளிக் கொடுக்கின்ற ஹோமம்.\nபகவான் ஸ்ரீமன் நாராயணனின் அருள் கிடைத்தால் நம்முடைய எல்லா காரியங்களும் சித்தி அடையும் எந்தவித குறைவும் இன்றி வாழ்க்கை நல்லபடியாக நடக்கும். புதன் கிரகத்தின் உடைய தோஷங்கள் விலகும்.',
        imgUrl: 'img/homam/narayanan.png',
        span: 3,
        height: 'l'
    },
    
    {
        eTitle: 'Sri Sudharshana Homam | Sri Lakshmi Narashimha Homam',
        tTitle: 'ஸ்ரீ மஹா சுதர்சனம்  |  ஶ்ரீ லக்ஷ்மி நரசிம்ம ஹோமம்',
        desc: 'ஸ்ரீ உமாமகேஸ்வரர் ஹோமம் நம்முடைய கஷ்டத்தை போக்கி நல்வழியை காட்டுகின்ற ஒரு அரிய பூஜை பக்தர்களுக்கு எல்லா பலன்களும் கிடைக்கும் ராகுதோஷம் நீங்கும்,  சந்திரனுடைய தோஷங்கள் நீங்கும். ஸ்ரீ உமாமகேஸ்வரர் அபிஷேகம் செய்து வந்தால் நல்ல பலன்கள் கிட்டும்.',
        imgUrl: 'img/homam/sudharshanam.png',
        span: 2,
        height: 'm'
    },
    
    {
        eTitle: 'Sri Maha Ganapathi Homam',
        tTitle: 'ஸ்ரீ மகா கணபதி ஹோமம்',
        desc: 'ஸ்ரீ மஹா கணபதி  ஹோமம்  வெற்றியைக் கொடுக்கும் அனைத்து தடைகள் நீங்கும் மேன்மை, புகழ், கல்வி, ஐஸ்வரியம், ஆயுள் விருத்தி, உண்டாகும். எடுத்த காரியத்தில் வெற்றி ஏற்படும்.\nராகு கேது தோஷங்கள் நீங்கும். எண்ணிய பலன் கிடைக்கும்.',
        imgUrl: 'img/homam/ganapathi.png',
        span: 1,
        height: 'm'
    },
    
    {
        eTitle: 'Sri Uma Maheshwara Homam',
        tTitle: 'ஸ்ரீ உமாமகேஸ்வரர் ஹோமம்',
        desc: 'ஸ்ரீ உமாமகேஸ்வரர் ஹோமம் நம்முடைய கஷ்டத்தை போக்கி நல்வழியை காட்டுகின்ற ஒரு அரிய பூஜை பக்தர்களுக்கு எல்லா பலன்களும் கிடைக்கும் ராகுதோஷம் நீங்கும்,  சந்திரனுடைய தோஷங்கள் நீங்கும். ஸ்ரீ உமாமகேஸ்வரர் அபிஷேகம் செய்து வந்தால் நல்ல பலன்கள் கிட்டும்.',
        imgUrl: 'img/homam/sundareshwarar.png',
        span: 1,
        height: 'm '
    },
    
    {
        eTitle: 'Sri Brahma Saraswathi Homam',
        tTitle: 'ஸ்ரீ பிரம்மா சரஸ்வதி ஹோமம்',
        desc: 'குழந்தைப்பேறு வேண்டுபவர்கள் இந்த ஹோமத்தை செய்ய வேண்டும். தங்களுடைய 80வது பூர்த்தி வைபவத்தில் பஞ்ச பிரம்மா என்று  பிரம்மா ஹோமம் செய்து கொள்ள வேண்டும். கல்வி கேள்வி சாத்திரம் ஞானம் நல்ல படிப்பு மேன்மை நல்லறிவு விஞ்ஞானத்தில் மேன்மை ஏற்பட ஸ்ரீ சரஸ்வதி தேவியின் அருள் இந்த பூஜையினால் பரிபூரணமாக கிட்டும்.',
        imgUrl: 'img/homam/brahma.png',
        span: 1,
        height: 'm '
    },
    
    {
        eTitle: 'Sri Seetha Raama Homam  |  Sri Santhana Krishna Homam',
        tTitle: 'ஸ்ரீ சீதாராம ஹோமம்  |  ஸ்ரீ சந்தான கோபால கிருஷ்ண ஹோமம்',
        desc: 'தந்தை சொல் மிக்க மந்திரம் இல்லை என்பதுபோல் குழந்தைகள் பெற்றோர்களை மதித்து நடப்பார்கள் பெற்றோர் சொல் கேட்பார்கள் அமைதி நல்லகுணம் செயல்திறன் சாதுரியம் விவேகம் அனைத்து நல்ல குணங்களும் வந்துசேரும் குழந்தை பாக்கியம் வேண்டுவோர் ஸ்ரீ சந்தான கோபால கிருஷ்ணன் பூஜையை ஹோமத்தை செய்வதால் அந்த கிருஷ்ணனே குழந்தையாக பிறப்பான் என்பது பெரியோர்கள் வாக்கு ஸ்ரீ சந்தான கோபால கிருஷ்ணன் பூஜையானது சந்தான பாக்கியம் கொடுக்கும் குழந்தைக்கு தீர்க்க ஆயுள் ஆரோக்கியம் ஐஸ்வர்யம் அனைத்தும் கொடுக்கும்',
        imgUrl: 'img/homam/sriram.png',
        span: 2,
        height: 'm '
    },
    
    {
        eTitle: 'Sri Lakshmi Hayagreeva Homam',
        tTitle: 'ஸ்ரீ லக்ஷ்மி ஹயக்ரீவர் ஹோமம்',
        desc: 'குழந்தைகளுக்கும் பெரியவர்களுக்கும் தூய எண்ணங்களும் சிறந்த நற்பண்புகள், நல்ல படிப்பு அறிவு ஞானம் கிரகிக்கும் தன்மை சிறந்த சொல்வளம் மேன்மையான கல்வி கிடைக்கும்.\nவேதம் இதிகாசம் புராணம் நன்கு அறியக்கூடிய புத்தி மேன்மை ஏற்படும் கிடைக்கும்.',
        imgUrl: 'img/homam/hayagriva.png',
        span: 1,
        height: 'm '
    },
    
    {
        eTitle: 'Sri Lakshmi Kubera Homam',
        tTitle: 'ஸ்ரீ லட்சுமி குபேர ஹோமம்',
        desc: 'ஸ்ரீ சங்க நிதி பத்ம நிதி இந்த இரண்டு நிதிகளும் ஸ்ரீ லட்சுமி குபேரனிடம் உண்டு லட்சுமி குபேர பூஜை யாகம் ஹோமம் செய்தால் இழந்த செல்வத்தை மீண்டும் பெறலாம் புதிதாக செல்வத்தை கேரளாவில் அபிவிருத்தி ஏற்படும் நல்ல சுகமான வாழ்க்கை ஏற்படும் குபேரன் போல் வாழலாம்.',
        imgUrl: 'img/homam/kuberan.png',
        span: 1,
        height: 'm '
    },
    
    {
        eTitle: 'Sri Dhakshina Moorthi Homam',
        tTitle: 'ஸ்ரீ தக்ஷிணாமூர்த்தி ஹோமம்',
        desc: 'ஸ்ரீ தக்ஷிணாமூர்த்தி குருவாக இருப்பதால் அனைவருக்கும் கல்வி ஞானம் பக்தி அறிவு மேன்மை ஏற்படும் குரு பகவானுடைய தோஷம் நீங்கும் குழந்தை பேறு கிடைக்கும்',
        imgUrl: 'img/homam/dhakshinamoorthi.png',
        span: 1,
        height: 'm '
    },
    
    {
        eTitle: 'Sri Boovaraha Homam',
        tTitle: 'ஸ்ரீ பூவராகப் ஹோமம்',
        desc: 'நம்முடைய சிறந்த கனவான காலி மனைகள் வாங்குவதற்கும் வீடு கட்டுவதற்கும் தோட்டங்கள் விவசாய நிலங்கள் வாங்குவதற்கும் அடுக்கு மாடி குடியிருப்புகள் கட்டவும் இந்த பூவராக ஹோமம் மிகச் சிறந்தது மேலும் நீங்கள் விற்க வேண்டிய நிலத்தை நல்ல ஆதாயத்துடன் விற்பதற்கு அனுகூலமாக இருக்கும்',
        imgUrl: 'img/homam/varahaswamy.png',
        span: 1,
        height: 'm '
    },
    
    {
        eTitle: 'Sri Dhanvanthri Narayana Homam',
        tTitle: 'ஸ்ரீ தன்வந்திரி நாராயண ஹோமம்',
        desc: 'உடல் நோய் உபாதை உள்ளவர்கள் நீண்டநாள் நோய்வாய்ப்பட்டவர்கள் தீராத வியாதி உள்ளவர்கள் மனக்குழப்பங்கள் உள்ளவர்கள் இந்தப் பூஜை செய்வதனால் கஷ்டங்கள் அனைத்தும் நீங்கி நல்ல ஆரோக்கியத்துடனும் மன அமைதியுடனும் நல்ல ஆயுளோடும் ஐஸ்வர்ய தோடும் ஸ்ரீதன்வந்திரி பெருமாளின் பரிபூரண அனுக்கிரகம் கிடைத்து இருப்பார்கள்',
        imgUrl: 'img/homam/dhanvantari.png',
        span: 1,
        height: 'm '
    },
    
    {
        eTitle: 'Sri Mruthunjaya Homam',
        tTitle: 'ஸ்ரீ மிருத்யுஞ்சய ஹோமம்',
        desc: 'தீராத நோய் தீரவும் நல்ல ஆரோக்கியத்துடனும் நீண்ட ஆயுளுடனும் இருக்க  ஸ்ரீ மிருத்யுஞ்ஜய ஹோமம் செய்ய வேண்டும். திடீர் ஆபத்துக்கள் விலகும் அல்ப ஆயுசு தோஷம் நீங்கும் தீர்க்க ஆயுள் உண்டு',
        imgUrl: 'img/homam/mruthyunjayar.png',
        span: 1,
        height: 'm '
    },
    
    {
        // TODO: type palangal for aanchaneya homam
        eTitle: 'Sri Aanchaneya Homam',
        tTitle: 'ஸ்ரீ ஆஞ்சநேய ஹோமம்',
        desc: 'சகலவிதமான துஷ்ட தேவதைகளின் கஷ்டங்கள் நீங்கும் மனோபலம் உண்டாகும் புத்திக்கூர்மை சாதுரியம் எதையும் செய்யக்கூடிய உற்சாகம் கணவன் மனைவி ஒற்றுமை உண்டாகும் விரைவில் திருமணம் நடக்கும் அன்பு பணிவு கருணை நேர்மை பண்புகள் உண்டாகும்.',
        imgUrl: 'img/homam/hanuman.png',
        span: 1,
        height: 'm '
    },
    
    {
        eTitle: 'Sri Subramanya Homam',
        tTitle: 'ஸ்ரீ சுப்பிரமணிய ஹோமம்',
        desc: 'நல்ல அழகான தோற்றம் கிடைக்கும். விரைவில் திருமணம் நடக்கும் சத்ரு சம்ஹார மூர்த்தி ஆகையால் எதிரிகளை வெல்லலாம் நல்ல குழந்தை பாக்கியம். உண்டாகும் நல்ல புகழை அடையலாம்.',
        imgUrl: 'img/homam/murugan.png',
        span: 1,
        height: 'm '
    },
    
    {
        eTitle: 'Sri Navagraha Homam',
        tTitle: 'ஸ்ரீ நவக்ரஹ ஹோமம்',
        desc: 'நம் வாழ்க்கையில் நவக்கிரகங்களில் சேர்க்கையே நம்முடைய நல்லது கெட்டது நிர்ணயம் செய்கின்றன.\nதொழில், வியாபாரம், உத்தியோகம், வெளிநாட்டில் வேலை,வெளிநாட்டில் தங்குவது, அரசாங்கத்தில் பெரும் பதவி கிடைக்க, பெரும்புகழ் ஏற்பட, வீடு மனை வாகனம் அனைத்து வசதிகளும் உண்டாக, புத்திர பாக்கியம் ஏற்பட, முன்னோர்களுடைய பூர்வீக சொத்துக்கள் கிடைக்க, தொழில் வியாபாரத்தில் அஷ்ட ஐஸ்வர்யங்கள் பெருக, சுபகாரியங்கள் இனிதே நடக்க ஸ்ரீ நவக்கிரக ஹோமம் செய்வதினால் பலன் கிடைக்கும். இந்த நவக்கிரக ஹோமம் செய்தால் எல்லா நவகிரக தோஷங்களும் வீண் விரயங்களும் நோய்களும் மனக் குழப்பங்களும் நீங்கும் ஸ்ரீ நவகிரகத்தின் அருள் கிடைத்து வாழ்வில் மகிழ்ச்சி ஏற்படும்.',
        imgUrl: 'img/homam/navagraham.png',
        span: 2,
        height: 'sm '
    },
    
    {
        eTitle: 'Sri Aayushya Homam',
        tTitle: 'ஸ்ரீ ஆயுஷ்ய ஹோமம்',
        desc: 'நமக்கு நீண்ட ஆயுள் கிடைக்க ஆரோக்கியமான வாழ்வு ஏற்பட ஆயுஷ்ஹோமம் சிறந்தது',
        imgUrl: 'img/homam/ayush.png',
        span: 1,
        height: 'm '
    },
    
    {
        eTitle: 'Sri Maha Prathyangara Devi Homam  |  Sri Varahi Homam  |  Sri Indirakshi Homam',
        tTitle: 'ஸ்ரீ பிரத்யங்கிரா  |  ஸ்ரீ வாராஹி  |  ஸ்ரீ இந்திராக்ஷி ஹோமம்',
        desc: 'நம்முடைய எதிரிகளின் தொல்லைகள் நீங்க, திருஷ்டி தோஷம் போக,பில்லி சூனியம் ஏவல் முதலான தொல்லைகள் நீங்க, எதிரிகளை வெல்ல, கடுமையான நோய்கள் தீர, குரு சாபம், குலதெய்வ சாபம், தேவதைகள் சாபம் நீங்க, இந்த மூன்று தேவிகளின் ஹோமம் செய்ய சிறப்பாகும்.',
        imgUrl: 'img/homam/varahi.png',
        span: 3,
        height: 'm '
    }
    
]

const pariharams = [
    {
        eTitle: 'Thila homam | Pithru shanthi homam',
        tTitle: 'தில ஹோமம் | பித்ரு சாந்தி ஹோமம்',
        desc: 'நமுன்னோர்களுக்கு செய்ய வேண்டிய பூஜை திலஹோமம் முன்னோர்களுடைய சாபமும் தோஷம் இருந்தால் வருஷ திதி வருஷாப்திகம் செய்யாதவர்கள்\nஇந்த பூஜை கண்டிப்பாக செய்ய வேண்டும்.\nகுடும்பப் பெண்களால் சாபம் அடைவதும் துர்மரணங்கள் விபத்துகள் தற்கொலைகள் நடந்திருந்தால் இந்த திலஹோமம் கண்டிப்பாக செய்ய வேண்டும் இதற்கு பித்ரு சாந்தி என்று பெயர்',
        imgUrl: 'img/pariharam/thila.png',
        span: 1,
        height: 's '
    },
    {
        eTitle: 'Naga shanthi | Sarpa shanthi',
        tTitle: 'நாக சாந்தி | சர்ப்ப சாந்தி ஹோமம்',
        desc: 'ஜாதகத்தில் குடும்ப ஸ்தானத்திலும் லக்னத்தில் களத்திர ஸ்தானமான 7-ஆம் இடத்திலோ ராகு கேது இருந்தாலும் காலசர்ப்ப தோஷங்கள் இருந்தாலும் ஜாதகருக்கு நாகதோஷம் வந்துவிடும் குடும்ப வாழ்க்கை, திருமணம் தடைபடும் குழந்தைப்பேறுக்கு தடைபடும் கணவன் மனைவி ஒற்றுமை இல்லாமல் இருக்கும் இந்த தோஷம் நீங்குவதற்கு நாக சாந்தி சர்ப்ப சாந்தி ஹோமம் செய்ய வேண்டும்',
        imgUrl: 'img/pariharam/naga.png',
        span: 1,
        height: 's '
    },
    {
        eTitle: 'Marriage dhosham',
        tTitle: 'இரு திருமண தார தோஷம் ஆண்களுக்கு வாழை மர திருமணம் பெண்களுக்கு  எருக்கஞ்செடி கல்யாணம்',
        desc: 'ஜாதகத்தில் ஆணுக்கோ பெண்ணுக்கோ 2ம் இடம் 7 ம் இடம் கெட்டுவிட்டால் அந்த கிரகம் மறைவாகவும் நீசமாகவோ இருந்தால் இரு தார தோஷம் ஏற்படும் 2 முறை திருமணம் நடக்கும் இந்த தோஷம் விலக ஆண்களுக்கு வாழைமர கல்யாணமும் பெண்களுக்கு எருக்கஞ்செடி கல்யாணமும் செய்ய வேண்டும்',
        imgUrl: 'img/pariharam/marriage.png',
        span: 1,
        height: 's '
    },
]

app.use( express.static( "sass" ) );

app.set('view engine', 'ejs');
app.set('views', path.join(__dirname, 'views'));
  
app.get('/', (req, res) => {
    res.render('home', {services: services, servicesLg: servicesLg, products: products, homams: homams, pariharams: pariharams});
})

app.get('/galary', (req, res) => {
    res.render('galary');
})

app.get('/Homam', (req, res) => {
    res.render('galary');
})

app.get('/galary', (req, res) => {
    res.render('galary');
})

app.get('/galary', (req, res) => {
    res.render('galary');
})

app.listen(3000, () => {
    console.log("Serving on port 3000");
})